[{"Country": "Australia", "Visa requirement": "Visa required", "Notes": "Australia offers a Transit visa, Subclass 771 that crew member and their dependents transit through the country for 72 hours.[2] The crew members are also required to produce a police certificate from each country they have lived in for 12 months or more during the last 10 years after turning to 16 years of age.[3]"}, {"Country": "Brazil", "Visa requirement": "Visa not required[4]", "Notes": "A transit visa is not required through Rio de Janeiro Galeao International or Sao Paulo Guarulhos. The crew member must carry a valid passport with a validity of at least 6 months with 2 blank visa pages and all necessary documents for the next destination.[5]"}, {"Country": "Canada", "Visa requirement": "Visa not required", "Notes": "Flight crew flying into Canada while on duty do not require a visa- or an eTA, in case of visa-exempt nationalities other than the US- to enter the country.[6] The length of stay for commercial aircrew is a maximum of 48 hours."}, {"Country": "China", "Visa requirement": "Visa required", "Notes": "A crew member employed on board in China needs a crew visa, C Visa.[7] The visa is issued to foreign crew members and their family members engaged in cross-border transport activities. They are required to enter into or exit from China with the aircraft, train or ship they are crew for. They are required to complete one visa application form V.2013 per person, and produce their actual passport, photograph, an introduction letter from the employer on business letterhead, a copy of employee ID and other relevant documents. A five-year multiple-entry visa is only issued to US passport holders. Otherwise, the multiple entry visa is valid for a period of 2 years.[8]"}, {"Country": "France", "Visa requirement": "Visa required", "Notes": "Visa on arrival if holding a valid visa or permanent resident card for the US or Canada. France has free visa policy for all countries except Albania, Mongolia, Belize, Samoa, Bhutan, St Kitts & Nevis, Dominica, Tuvalu, Hong Kong, Israel and United States of America. The crew members from these countries require a circulation visa valid for one year and American and Israeli crew members visa is valid for five years with respect to reciprocity. During the time of application, the passport validity must exceed by at least 3 months.[9]"}, {"Country": "Germany", "Visa requirement": "Visa required", "Notes": "The crew member who has Schengen visa is free to transit from Germany. The German Embassy can receive visa applications from accredited shipping agencies and airlines, where crew member need has to establish his identity as a traveler and declare the purpose of his visit.[10]"}, {"Country": "India", "Visa requirement": "Visa required[11]", "Notes": "The Embassy of India does not issue a crew visa directly, however it is issued by Indian missions and posts. Pilots and crew members are required to needing prior clearance from authorities in India which includes, landing permit issued by the DGCA, ICAO issued by the FAA, Certificate of Incorporation of the airline or cargo operator, Letter of Invitation, business letter and address proof.[12] A landing permit facility, up to a maximum of 72 hours, can be given to a foreigner who enters India by Air or Sea, without a valid visa, under emergent condition connected with or relevant to an event or action.[13]"}, {"Country": "Indonesia", "Visa requirement": "Visa not required", "Notes": "Passport holders from Visa free countries who wish to enter Indonesia for the transit can do so without visa through all air, sea or land crossing points."}, {"Country": "Japan", "Visa requirement": "Visa required", "Notes": "The crew members are required to present a business letter from their company mentioning purpose of the trip, a financial guarantee statement, specify applicant's position, annual salary and employment term. A letter of invitation from the Japan’s company office is also required to visit in Japan.[14]"}, {"Country": "Sri Lanka", "Visa requirement": "Visa not required", "Notes": "Crew members of flights & ships do not require a visa in Sri Lanka. It offers free visa policy to the crew members for all countries.[15]"}, {"Country": "United States", "Visa requirement": "Visa required[16]", "Notes": "A crew member serving on board in the United States needs a crew visa C-1, D, C1/D or a modified B-1 visa, except for citizens of Canada. To apply for a crew visa, the crew members must demonstrate purpose of your trip is solely for transit or crew purposes, not to be paid by a U.S. source, stay for a limited period of time and evidence of funds to cover all expenses during the stay."}, {"Country": "United Kingdom", "Visa requirement": "Visa required[17]", "Notes": "UK Visas and Immigration department offers CRM01 for seafarers and CRM02 for Aircrew. The immigration act 1971 cover seafarers under Section 8(1) and aircrew under Section 33(1).[18] The aircrew members must have a valid passport, authorized crew member certificate or a pilot’s licence.[19] The security guards, trainee crew members and loadmasters in the country are not considered as operating crew and they need applicable visa to work as a crew.[20][21] EEA nationals coming on a short term visit are not subject to restrictions, they need only either a National Identity Card or a passport."}, {"Country": "Vietnam", "Visa requirement": "Visa not required", "Notes": "The Embassy of Vietnam also does not issue a crew visa, the crew member needs to provide a letter on the company letterhead describing the purpose of their trip, dates of entry and exit and providing a financial guarantee, signed by a company representative.[22] Vietnam has visa exemptions policy for the flight crew members of 12 countries including United States, Qatar, Uzbekistan, Japan, Australia, Russia, Hong Kong, South Korea, France, Kazakhstan, Poland and Luxembourg.[23] The Visa exemption policy for flight crew members was first put into force in 2002."}]